Feature: Резервация на билет за прожекция на филм
Background: 
		Given Потребителя отваря екрана за резервация

  Scenario: Успешна резервация на билет
    When Потребителят избере прожекция: 1
    And Избере 2 билета "Възрастен"
    And Избере места:
    |1|
    |2|
    And Въведе имейл: "joro@abv.bg"
    And Натисне бутона за резервиране на билет
    Then Вижда съобщение: "Успешно резервиране на билет!".
    
  Scenario: Опит за резервация на билет при недостатъчно места
    When Потребителят избере прожекция: 1
    And Избере 8 билета "Възрастен"
    And Избере места:
    |1|
    And Въведе имейл: "joro@abv.bg"
    And Натисне бутона за резервиране на билет
    Then Вижда съобщение: "Недостатъчно налични места!".

  Scenario: Опит за резервация на билет при невалиден имейл
    When Потребителят избере прожекция: 1
    And Избере 2 билета "Възрастен"
    And Избере места:
    |1|
    |2|
    And Въведе имейл: "joroabv.bg"
    And Натисне бутона за резервиране на билет
    Then Вижда съобщение: "Въведеният имейл е невалиден!".
 
  Scenario:  Опит за резервация на билет при избиране на заети места
    When Потребителят избере прожекция: 1
    And Избере 1 билета "Възрастен"
    And Избере места: 
    |4|
    And Въведе имейл: "joro@abv.bg"
    And Натисне бутона за резервиране на билет
    Then Вижда съобщение: "Избраните места са заети!".
    
  Scenario: Опит за резервация на билет при по-малко от час до началото на филма
    When Потребителят избере прожекция: 2
    And Избере 1 билета "Възрастен"
    And Избере места: 
    |2|
    And Въведе имейл: "joro@abv.bg"
    And Натисне бутона за резервиране на билет
    Then Вижда съобщение: "Резервациите за тази прожекция не са налични".
    
    Scenario: Успешна резервация на билет
    When Потребителят избере прожекция: 1
    And Избере 1 билета "Възрасте"
    And Избере места:
    |1|
    And Въведе имейл: "joro@abv.bg"
    And Натисне бутона за резервиране на билет
    Then Вижда съобщение: "Такъв билет не съществува!".